tutorials/CFD/26AirfoilMotionRansML/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
12556
(
(100.0265475 -0.02841735167 -7.71438197e-24)
(100.093034 -0.1563652709 -4.234456862e-20)
(100.2182753 -0.4893434157 -4.244403247e-20)
(100.6837576 -1.45384441 -4.264106047e-20)
(101.3702199 1.700911426 1.851005455e-22)
(99.98774304 -0.2497116578 0)
(99.93001589 -0.05004724582 0)
(99.98680919 0.02132669321 -1.713234657e-23)
...
)
;

boundaryField
{
    topAndBottom
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (100 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 
62
(
(106.2656207 -0.07747551115 0)
(106.2674755 -0.2442333138 0)
(106.3701422 -0.6411456254 0)
(106.7111429 -2.407785496 0)
(94.92124268 1.51800137 0)
(94.4000708 0.1912028941 0)
(94.1669164 -0.006037365623 0)
(94.07962586 -0.00641634357 0)
...
)
;
    }
    wing
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
