tutorials/CFD/26AirfoilMotionRansML/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs (sixDoFRigidBodyMotion);

motionSolver    sixDoFRigidBodyMotion;

// Not necessarily useful here, but can have different motion updates types
updateControl   timeStep;
updateInterval  1;

sixDoFRigidBodyMotionCoeffs
{
        patches         (wing);
        innerDistance   0.3;
        outerDistance   1;

        mass            22.9;
        centreOfMass    (0.4974612746 -0.01671895744 0.125);
        momentOfInertia (1.958864357 3.920839234 2.057121362);
        orientation
        (
            0.9953705935 0.09611129781 0
            -0.09611129781 0.9953705935 0
            0 0 1
        );
        angularMomentum (0 0 -2);
        g               (0 -9.81 0);
        accelerationRelaxation 0.9125;
        accelerationDamping 0.9125;
        rho             rhoInf;
        rhoInf          1;
        CofR     (0.25 0.007 0.125);
        report          on;

        solver
        {
            type symplectic;
        }

        constraints
        {
            yLine
            {
                sixDoFRigidBodyMotionConstraint line;
                centreOfRotation    (0.25 0.007 0.125);
                direction           (0 1 0);
            }

            zAxis
            {
                sixDoFRigidBodyMotionConstraint axis;
                axis                (0 0 1);
            }
        }

        restraints
        {
            verticalSpring
            {
                sixDoFRigidBodyMotionRestraint linearSpring;

                anchor          (0.25 0.007 0.125);
                refAttachmentPt (0.25 0.007 0.125);
                stiffness       361622.3053; //4000;
                damping         2;
                restLength      0;
            }

            axialSpring
            {
                sixDoFRigidBodyMotionRestraint linearAxialAngularSpring;

                axis            (0 0 1);
                stiffness       32484.75848; //700;
                damping         0.5;
                referenceOrientation $orientation;
            }
        }
}    


// ************************************************************************* //
