tutorials/CFD/26AirfoilMotionRansML/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          72;
        startFace       25162;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       25234;
    }
    outlet
    {
        type            patch;
        nFaces          62;
        startFace       25274;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          378;
        startFace       25336;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12556;
        startFace       25714;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12556;
        startFace       38270;
    }
)

// ************************************************************************* //
