tutorials/CFD/26AirfoilMotionRansML/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;
//EigenSolver spectra;

// Number of modes to output and to use for projection
NmodesUout 50;
NmodesUproj 7; //15

NmodePUout 50;
NmodesPproj 3; //5?????

NmodesNutOut 50;
NmodesNutProj 5; //10

NmodesDout 10;
NmodesDproj 3;

debug 1;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

//bcMethod penalty;
warning false;
POD_pointDisplacement  Frobenius;// L2;
//POD_DataPoints   Frobenius;
// // Do not export middle fields for this case
epochs 120; //500

bcMethod      lift; 
