tutorials/CFD/26AirfoilMotionRansML/system/fvSchemes(Initial)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward; //CrankNicolson 0.9; //backward;
}

gradSchemes
{
    default         Gauss linear;
    //default         cellLimited Gauss linear 1;
    //grad(p)         leastSquares; //fourth
    grad(U)         Gauss linear;
    grad(p)         Gauss linear; //0.333;
}

divSchemes
{
    default         none;

    div(phi,U)       Gauss linearUpwind grad(U);
    //div(phi,U)      Gauss vanLeer;

    turbulence      Gauss limitedLinear 1;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;
    //div(U)          Gauss vanLeer;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{

    default        Gauss linear corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected 0.5;
    //default         limited 0.5;
}
fluxRequired
{
    default         no;
    p;
    Phi;
}


wallDist
{
    method          meshWave;
}


// ************************************************************************* //
