tutorials/CFD/26AirfoilMotionRansML/system/fvSchemes(oftenused)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;    //backward; //Euler
}

gradSchemes
{
     default  Gauss linear; //1
     grad(U)  Gauss linear;  //1  //cellMDLimited
     //grad(U) cellMDLimited Gauss linear 1; //cellMDLimited
}

divSchemes
{
        default none;
        div(phi,U)    Gauss upwind;
        //div(phi,U)    Gauss vanLeer;//nope
        //div(phi,U) Gauss linearUpwind grad(U); //nope
        div(phi,omega) Gauss upwind;
        div(phi,k) Gauss upwind;
        div((nuEff*dev(T(grad(U))))) Gauss linear;
        div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default Gauss linear corrected 0.5;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected 0.5;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
