tutorials/CFD/26AirfoilMotionRansML/system/fvSchemes2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward; //CrankNicolson 0.9; //backward;
}

gradSchemes
{
    //default         Gauss linear;
    //grad(p)         leastSquares; //fourth; //leastSquares; //
    //grad(U)         Gauss linear;
     default         cellMDLimited Gauss linear 0.5;
    // grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)     bounded Gauss linearUpwind grad(U);
    turbulence      bounded Gauss limitedLinear 1;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    //default         Gauss linear limited corrected 0.5;
    default        Gauss linear limited 1.0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    //default         corrected;
    default         limited 1.0;
}

fluxRequired
{
    default         no;
    p;
    Phi;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
